# VertexPair Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexPair Class
Members See Also
---
Indices of a pair of vertices in two CurveLoops(one vertex in each loop).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class VertexPair : IDisposable
```

Visual Basic
---
```text
Public Class VertexPair _
	Implements IDisposable
```

Visual C++
---
```text
public ref class VertexPair : IDisposable
```

# Remarks
A vertex is specified by the index in the CurveLoop of the curve having that vertex as its start point. Indexes start at 0.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..VertexPair
# See Also
VertexPair Members
Autodesk.Revit.DB Namespace